kangxi = \
    "⼀⼁⼂⼃⼄⼅⼆⼇⼈⼉⼊⼋⼌⼍⼎⼏" \
    "⼐⼑⼒⼓⼔⼕⼖⼗⼘⼙⼚⼛⼜⼝⼞⼟" \
    "⼠⼡⼢⼣⼤⼥⼦⼧⼨⼩⼪⼫⼬⼭⼮⼯" \
    "⼰⼱⼲⼳⼴⼵⼶⼷⼸⼹⼺⼻⼼⼽⼾⼿" \
    "⽀⽁⽂⽃⽄⽅⽆⽇⽈⽉⽊⽋⽌⽍⽎⽏" \
    "⽐⽑⽒⽓⽔⽕⽖⽗⽘⽙⽚⽛⽜⽝⽞⽟" \
    "⽠⽡⽢⽣⽤⽥⽦⽧⽨⽩⽪⽫⽬⽭⽮⽯" \
    "⽰⽱⽲⽳⽴⽵⽶⽷⽸⽹⽺⽻⽼⽽⽾⽿" \
    "⾀⾁⾂⾃⾄⾅⾆⾇⾈⾉⾊⾋⾌⾍⾎⾏" \
    "⾐⾑⾒⾓⾔⾕⾖⾗⾘⾙⾚⾛⾜⾝⾞⾟" \
    "⾠⾡⾢⾣⾤⾥⾦⾧⾨⾩⾪⾫⾬⾭⾮⾯" \
    "⾰⾱⾲⾳⾴⾵⾶⾷⾸⾹⾺⾻⾼⾽⾾⾿" \
    "⿀⿁⿂⿃⿄⿅⿆⿇⿈⿉⿊⿋⿌⿍⿎⿏" \
    "⿐⿑⿒⿓⿔⿕"

# U+4E00 ~ U+9FFF 的康熙部首
normal = \
    "一丨丶丿乙亅二亠人儿入八冂冖冫几" \
    "凵刀力勹匕匚匸十卜卩厂厶又口囗土" \
    "士夂夊夕大女子宀寸小尢尸屮山巛工" \
    "己巾干幺广廴廾弋弓彐彡彳心戈戶手" \
    "支攴文斗斤方无日曰月木欠止歹殳毋" \
    "比毛氏气水火爪父爻爿片牙牛犬玄玉" \
    "瓜瓦甘生用田疋疒癶白皮皿目矛矢石" \
    "示禸禾穴立竹米糸缶网羊羽老而耒耳" \
    "聿肉臣自至臼舌舛舟艮色艸虍虫血行" \
    "衣襾見角言谷豆豕豸貝赤走足身車辛" \
    "辰辵邑酉釆里金長門阜隶隹雨靑非面" \
    "革韋韭音頁風飛食首香馬骨高髟鬥鬯" \
    "鬲鬼魚鳥鹵鹿麥麻黃黍黑黹黽鼎鼓鼠" \
    "鼻齊齒龍龜龠"

source = open('enc.txt', 'rt', encoding='utf-8').read()

cnt = 0
s = ''
for char in source:
    if char in kangxi:
        s+='1'
        cnt += 1
    elif char in normal:
        s+='0'
        cnt += 1
print(s)
print(cnt)
result = []
for i in range(0, len(s)+2, 7):
    byte = int(s[i:i+7], 2)
    result.append(byte+32)
    if i%2 ==1:
        print(chr(int(byte+32)),end='')
